#pragma once
/* This was generated by capra_micro_comm.
* DO NOT EDIT
*/
#include <capra_comm.h>

// --- ENUMS ---
// --- STRUCTS ---
struct Void
{
    euint8_t pad0;
};
static_assert(sizeof(Void) == 1);

struct Vector2D
{
    efloat_t x;
    efloat_t y;
};
static_assert(sizeof(Vector2D) == 8);

struct State
{
    eboolean_t state;
};
static_assert(sizeof(State) == 1);

struct Status
{
    euint8_t statusCode;
};
static_assert(sizeof(Status) == 1);

struct UInt8
{
    euint8_t value;
};
static_assert(sizeof(UInt8) == 1);

struct RGB
{
    efloat_t r;
    efloat_t g;
    efloat_t b;
};
static_assert(sizeof(RGB) == 12);

// --- COMMANDS ---
Status ledOn(Void);
static_assert((sizeof(Void)+1) == 2);

Status ledOff(Void);
static_assert((sizeof(Void)+1) == 2);

Status setLedState(State);
static_assert((sizeof(State)+1) == 2);

UInt8 loopback(UInt8);
static_assert((sizeof(UInt8)+1) == 2);

State patate(Status);
static_assert((sizeof(Status)+1) == 2);

BaseFunction_ptr commands[] = {
    new Function<Status, Void>(&ledOn),
    new Function<Status, Void>(&ledOff),
    new Function<Status, State>(&setLedState),
    new Function<UInt8, UInt8>(&loopback),
    new Function<State, Status>(&patate),
};
#define COMMANDS_COUNT 5
#define MAX_DECODED_SIZE 13
#define MAX_ENCODED_SIZE 21
