#pragma once
/* This was generated by capra_micro_comm.
* DO NOT EDIT
*/
#include <capra_comm.h>

// --- ENUMS ---
// --- STRUCTS ---
struct Void
{
    euint8_t pad0;
};
static_assert(sizeof(Void) == 1);

struct Bool
{
    eboolean_t b;
};
static_assert(sizeof(Bool) == 1);

struct Byte
{
    euint8_t b;
};
static_assert(sizeof(Byte) == 1);

struct Short
{
    eint16_t s;
};
static_assert(sizeof(Short) == 2);

struct UShort
{
    euint16_t s;
};
static_assert(sizeof(UShort) == 2);

struct Int
{
    eint32_t i;
};
static_assert(sizeof(Int) == 4);

struct UInt
{
    euint32_t i;
};
static_assert(sizeof(UInt) == 4);

struct Long
{
    eint64_t l;
};
static_assert(sizeof(Long) == 8);

struct ULong
{
    euint64_t l;
};
static_assert(sizeof(ULong) == 8);

struct Float
{
    efloat_t f;
};
static_assert(sizeof(Float) == 4);

struct Vector2D
{
    efloat_t x;
    efloat_t y;
};
static_assert(sizeof(Vector2D) == 8);

struct State
{
    eboolean_t state;
};
static_assert(sizeof(State) == 1);

struct Status
{
    euint8_t statusCode;
};
static_assert(sizeof(Status) == 1);

struct RGB
{
    efloat_t r;
    efloat_t g;
    efloat_t b;
};
static_assert(sizeof(RGB) == 12);

// --- COMMANDS ---
Void ledOn(Void);
static_assert((sizeof(Void)+1) == 2);

Void ledOff(Void);
static_assert((sizeof(Void)+1) == 2);

BaseFunction_ptr commands[] = {
    new Function<Void, Void>(&ledOn),
    new Function<Void, Void>(&ledOff),
};
#define COMMANDS_COUNT 2
#define MAX_DECODED_SIZE 13
#define MAX_ENCODED_SIZE 21
