#pragma once
/* This was generated by capra_micro_comm.
* DO NOT EDIT
*/

#include <capra_comm.h>


// --- STRUCTS ---
struct Void
{
    euint8_t pad0;
};
static_assert(sizeof(Void) == 1);

struct Bool_
{
    eboolean_t b;
};
static_assert(sizeof(Bool_) == 1);

struct Byte
{
    euint8_t b;
};
static_assert(sizeof(Byte) == 1);

struct Short
{
    eint16_t s;
};
static_assert(sizeof(Short) == 2);

struct UShort
{
    euint16_t s;
};
static_assert(sizeof(UShort) == 2);

struct Int
{
    eint32_t i;
};
static_assert(sizeof(Int) == 4);

struct UInt
{
    euint32_t i;
};
static_assert(sizeof(UInt) == 4);

struct Long
{
    eint64_t l;
};
static_assert(sizeof(Long) == 8);

struct ULong
{
    euint64_t l;
};
static_assert(sizeof(ULong) == 8);

struct Float
{
    efloat_t f;
};
static_assert(sizeof(Float) == 4);

struct Vector2D
{
    efloat_t x;
    efloat_t y;
};
static_assert(sizeof(Vector2D) == 8);

struct Status
{
    euint16_t statusCode;
};
static_assert(sizeof(Status) == 2);

struct RGB
{
    euint8_t r;
    euint8_t g;
    euint8_t b;
};
static_assert(sizeof(RGB) == 3);

struct LED
{
    euint16_t i;
    RGB c;
    euint8_t pad0;
};
static_assert(sizeof(LED) == 6);

struct Report
{
    Vector2D pos;
    Status status;
    euint8_t pad0;
    euint8_t pad1;
};
static_assert(sizeof(Report) == 12);

struct Bounds
{
    efloat_t lower;
    efloat_t upper;
};
static_assert(sizeof(Bounds) == 8);

struct PIDConfig
{
    efloat_t p;
    efloat_t i;
    efloat_t d;
    Bounds bounds;
};
static_assert(sizeof(PIDConfig) == 20);

struct Config
{
    PIDConfig horizPID;
    PIDConfig vertiPID;
};
static_assert(sizeof(Config) == 40);

// --- COMMANDS ---
Bool_ setLedColor(LED);
static_assert((sizeof(LED)+1) == 7);

Bool_ setFrontLedState(Bool_);
static_assert((sizeof(Bool_)+1) == 2);

Bool_ setBackLedState(Bool_);
static_assert((sizeof(Bool_)+1) == 2);

Bool_ setTPVPosition(Vector2D);
static_assert((sizeof(Vector2D)+1) == 9);

Vector2D getTPVPosition(Void);
static_assert((sizeof(Void)+1) == 2);

Bool_ setTPVSpeed(Vector2D);
static_assert((sizeof(Vector2D)+1) == 9);

Report getReport(Void);
static_assert((sizeof(Void)+1) == 2);

Bool_ setConfig(Config);
static_assert((sizeof(Config)+1) == 41);

BaseFunction_ptr commands[] = {
    new Function<Bool_, LED>(&setLedColor),
    new Function<Bool_, Bool_>(&setFrontLedState),
    new Function<Bool_, Bool_>(&setBackLedState),
    new Function<Bool_, Vector2D>(&setTPVPosition),
    new Function<Vector2D, Void>(&getTPVPosition),
    new Function<Bool_, Vector2D>(&setTPVSpeed),
    new Function<Report, Void>(&getReport),
    new Function<Bool_, Config>(&setConfig),
};
#define COMMANDS_COUNT 8
#define MAX_DECODED_SIZE 41
#define MAX_ENCODED_SIZE 57
